# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Вывод сети и маски должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов (в двоичном формате
  надо добавить два пробела между столбцами
  для разделения октетов между собой)

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""

net_in = input('Введите IP-сеть: ').replace('/', '.').split('.')
mask_diff = 32 - int(net_in[4])
mask_bin = '1' * int(net_in[4]) + '0' * mask_diff
first_octet_mask = int(mask_bin[0:8],2 )
second_octet_mask = int(mask_bin[8:16], 2)
third_octet_mask = int(mask_bin[16:24], 2)
forth_octet_mask = int(mask_bin[24:32], 2)
result = ('Network:' + '\n' +
          '{0:<10}'  + '{1:<10}'  + '{2:<10}'  + '{3:<10}'  + '\n' + '{0:08b}  ' + '{1:08b}  ' + '{2:08b}  ' + '{3:08b}  '
          + '\n' + 'Mask:' + '\n' + '/{4:}' + '\n' +
          '{5:<10}'  + '{6:<10}'  + '{7:<10d}'  + '{8:<10d}'  + '\n' + '{5:08b}  ' + '{6:08b}  ' + '{7:08b}  ' + '{8:08b}  ')
print(result.format(int(net_in[0]), int(net_in[1]), int(net_in[2]), int(net_in[3]), int(net_in[4]),
                    first_octet_mask, second_octet_mask, third_octet_mask, forth_octet_mask,
                    mask_bin[0:8], mask_bin[8:16], mask_bin[16:24], mask_bin[24:32]))